HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxEmem_mpu_bf.h
/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN1 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN1_OFF (1u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN2 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN2_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN2 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN2_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN2 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN2_OFF (2u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN3 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN3_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN3 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN3_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN3 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN3_OFF (3u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN4 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN4_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN4 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN4_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN4 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN4_OFF (4u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN5 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN5_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN5 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN5_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN5 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN5_OFF (5u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN6 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN6_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN6 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN6_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN6 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN6_OFF (6u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN7 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN7_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN7 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN7_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN7 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN7_OFF (7u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN8 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN8_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN8 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN8_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN8 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN8_OFF (8u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN9 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN9_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN9 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN9_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN9 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN9_OFF (9u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN10 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN10_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN10 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN10_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN10 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN10_OFF (10u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN11 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN11_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN11 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN11_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN11 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN11_OFF (11u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN12 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN12_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN12 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN12_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN12 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN12_OFF (12u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN13 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN13_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN13 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN13_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN13 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN13_OFF (13u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN14 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN14_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN14 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN14_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN14 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN14_OFF (14u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN15 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN15_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN15 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN15_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN15 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN15_OFF (15u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN16 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN16_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN16 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN16_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN16 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN16_OFF (16u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN17 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN17_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN17 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN17_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN17 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN17_OFF (17u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN18 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN18_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN18 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN18_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN18 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN18_OFF (18u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN19 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN19_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN19 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN19_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN19 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN19_OFF (19u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN20 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN20_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN20 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN20_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN20 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN20_OFF (20u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN21 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN21_LEN (1u)

