HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxEmem_mpu_bf.h
/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN56 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN56_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN56 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN56_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN56 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN56_OFF (24u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN57 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN57_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN57 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN57_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN57 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN57_OFF (25u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN58 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN58_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN58 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN58_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN58 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN58_OFF (26u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN59 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN59_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN59 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN59_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN59 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN59_OFF (27u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN60 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN60_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN60 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN60_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN60 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN60_OFF (28u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN61 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN61_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN61 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN61_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN61 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN61_OFF (29u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN62 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN62_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN62 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN62_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN62 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN62_OFF (30u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN63 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN63_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN63 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN63_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN63 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN63_OFF (31u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN0 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN0_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN0 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN0_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN0 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN0_OFF (0u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN1 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN1_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN1 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN1_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN1 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN1_OFF (1u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN2 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN2_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN2 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN2_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN2 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN2_OFF (2u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN3 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN3_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN3 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN3_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN3 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN3_OFF (3u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN4 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN4_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN4 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN4_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN4 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN4_OFF (4u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN5 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN5_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN5 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN5_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN5 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN5_OFF (5u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN6 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN6_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN6 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN6_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN6 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN6_OFF (6u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN7 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN7_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN7 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN7_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN7 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN7_OFF (7u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN8 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN8_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN8 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN8_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN8 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN8_OFF (8u)

