HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxEmem_mpu_bf.h
/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN9 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN9_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN9 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN9_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN9 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN9_OFF (9u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN10 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN10_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN10 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN10_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN10 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN10_OFF (10u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN11 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN11_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN11 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN11_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN11 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN11_OFF (11u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN12 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN12_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN12 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN12_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN12 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN12_OFF (12u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN13 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN13_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN13 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN13_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN13 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN13_OFF (13u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN14 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN14_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN14 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN14_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN14 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN14_OFF (14u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN15 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN15_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN15 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN15_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN15 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN15_OFF (15u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN16 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN16_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN16 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN16_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN16 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN16_OFF (16u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN17 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN17_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN17 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN17_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN17 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN17_OFF (17u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN18 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN18_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN18 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN18_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN18 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN18_OFF (18u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN19 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN19_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN19 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN19_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN19 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN19_OFF (19u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN20 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN20_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN20 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN20_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN20 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN20_OFF (20u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN21 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN21_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN21 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN21_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN21 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN21_OFF (21u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN22 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN22_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN22 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN22_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN22 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN22_OFF (22u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN23 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN23_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN23 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN23_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN23 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN23_OFF (23u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN24 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN24_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN24 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN24_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN24 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN24_OFF (24u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN25 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN25_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN25 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN25_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN25 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN25_OFF (25u)

