HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxEmem_mpu_bf.h
/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN42 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN42_OFF (10u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN43 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN43_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN43 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN43_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN43 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN43_OFF (11u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN44 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN44_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN44 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN44_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN44 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN44_OFF (12u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN45 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN45_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN45 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN45_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN45 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN45_OFF (13u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN46 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN46_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN46 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN46_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN46 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN46_OFF (14u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN47 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN47_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN47 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN47_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN47 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN47_OFF (15u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN48 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN48_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN48 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN48_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN48 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN48_OFF (16u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN49 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN49_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN49 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN49_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN49 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN49_OFF (17u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN50 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN50_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN50 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN50_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN50 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN50_OFF (18u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN51 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN51_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN51 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN51_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN51 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN51_OFF (19u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN52 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN52_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN52 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN52_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN52 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN52_OFF (20u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN53 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN53_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN53 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN53_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN53 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN53_OFF (21u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN54 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN54_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN54 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN54_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN54 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN54_OFF (22u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN55 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN55_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN55 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN55_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN55 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN55_OFF (23u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN56 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN56_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN56 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN56_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN56 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN56_OFF (24u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN57 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN57_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN57 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN57_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN57 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN57_OFF (25u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN58 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN58_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN58 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN58_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN58 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN58_OFF (26u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN59 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN59_LEN (1u)

