HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxEmem_mpu_bf.h
/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN59 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN59_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN59 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN59_OFF (27u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN60 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN60_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN60 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN60_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN60 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN60_OFF (28u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN61 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN61_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN61 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN61_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN61 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN61_OFF (29u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN62 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN62_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN62 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN62_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN62 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN62_OFF (30u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN63 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN63_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN63 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN63_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN63 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN63_OFF (31u)

/** \}  */

/******************************************************************************/

/******************************************************************************/

#endif /* IFXEMEM_MPU_BF_H */
